# A B C D E F G H I J K L M N O P Q R S T U V W X Y Z
# Z Y X W V U T S R Q P O N M L K J I H G F E D C B A

# А Б В Г Д Е Ё Ж З И Й К Л М Н О П Р С Т У Ф Х Ц Ч Ш Щ Ъ Ы Ь Э Ю Я
# Я Ю Э Ь Ы Ъ Щ Ш Ч Ц Х Ф У Т С Р П О Н М Л К Й И З Ж Ё Е Д Г В Б А

D = {'A': 'Z', 'B': 'Y', 'C': 'X', 'D': 'W', 'E': 'V', 'F': 'U', 'G': 'T', 'H': 'S', 'I': 'R',
     'J': 'Q', 'K': 'P', 'L': 'O', 'M': 'N', 'N': 'M', 'O': 'L', 'P': 'K', 'Q': 'J', 'R': 'I',
     'S': 'H', 'T': 'G', 'U': 'F', 'V': 'E', 'W': 'D', 'X': 'C', 'Y': 'B', 'Z': 'A'}
d = {'a': 'z', 'b': 'y', 'c': 'x', 'd': 'w', 'e': 'v', 'f': 'u', 'g': 't', 'h': 's', 'i': 'r',
     'j': 'q', 'k': 'p', 'l': 'o', 'm': 'n', 'n': 'm', 'o': 'l', 'p': 'k', 'q': 'j', 'r': 'i',
     's': 'h', 't': 'g', 'u': 'f', 'v': 'e', 'w': 'd', 'x': 'c', 'y': 'b', 'z': 'a'}
D_ru = {'А': 'Я', 'Б': 'Ю', 'В': 'Э', 'Г': 'Ь', 'Д': 'Ы', 'Е': 'Ъ', 'Ё': 'Щ', 'Ж': 'Ш', 'З': 'Ч',
        'И': 'Ц', 'Й': 'Х', 'К': 'Ф', 'Л': 'У', 'М': 'Т', 'Н': 'С', 'О': 'Р', 'П': 'П', 'Р': 'О',
        'С': 'Н', 'Т': 'М', 'У': 'Л', 'Ф': 'К', 'Х': 'Й', 'Ц': 'И', 'Ч': 'З', 'Ш': 'Ж', 'Щ': 'Ё',
        'Ъ': 'Е', 'Ы': 'Д', 'Ь': 'Г', 'Э': 'В', 'Ю': 'Б', 'Я': 'А'}
d_ru = {'а': 'я', 'б': 'ю', 'в': 'э', 'г': 'ь', 'д': 'ы', 'е': 'ъ', 'ё': 'щ', 'ж': 'ш', 'з': 'ч',
        'и': 'ц', 'й': 'х', 'к': 'ф', 'л': 'у', 'м': 'т', 'н': 'с', 'о': 'р', 'п': 'п', 'р': 'о',
        'с': 'н', 'т': 'м', 'у': 'л', 'ф': 'к', 'х': 'й', 'ц': 'и', 'ч': 'з', 'ш': 'ж', 'щ': 'ё',
        'ъ': 'е', 'ы': 'д', 'ь': 'г', 'э': 'в', 'ю': 'б', 'я': 'а'}


def encrypt(text):
    new = ""
    for s in text:
        if s.isalpha():
            if s.isupper():
                if 65 <= ord(s) <= 90:
                    new += D[s]
                else:
                    new += D_ru[s]
            else:
                if 97 <= ord(s) <= 122:
                    new += d[s]
                else:
                    new += d_ru[s]
        else:
            new += s
    return new


in_text = input("Введите текст для шифрования: \n")
final_text = encrypt(in_text)
print("Зашифрованный: ", final_text, "\nОбратная расшифровка: ", encrypt(final_text))